# ExportPatternTable Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable Constructor
ExportPatternTable Class See Also
---
Constructs a new ExportPatternTable with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternTable()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportPatternTable()
```

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace